app/Controllers/BankController.php

    public function index()
    {
        $userId = session()->get('user_id');

        if (!$userId) {
            return redirect()->to('/')->with('error', 'User not logged in.');
        }

        $userInfo = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`user_id` = '23'