app/Controllers/Register.php

INSERT INTO `users` (`user_name`, `user_email`, `user_password`) VALUES ('tojo', 'tojo516@gmail.com', '$2y$10$mrFDdPXuDghhCV1vyT4vS.wYpEcY/0XCwkhjBMc3AgOUwHpIpAjYO')
---
    public function save()
    {
        // Inclure le helper de formulaire
        helper(['form']);

        // Définir les règles de validation du formulaire
        $rules = [
            'name'         => 'required|min_length[3]|max_length[20]',
            'email'        => 'required|min_length[6]|max_length[50]|valid_email|is_unique[users.user_email]',
            'password'     => 'required|min_length[6]|max_length[200]',
            'confpassword' => 'matches[password]'
        ];

        if ($this->validate($rules)) {
            $model = new UserModel();
            $data = [
                'user_name'     => $this->request->getVar('name'),
                'user_email'    => $this->request->getVar('email'),
                'user_password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT),
                'balance'       => 0.00  // Balance initiale de 0 Ariary
            ];
            $model->save($data);