app/Models/LoanModel.php

INSERT INTO `loans` (`user_id`, `amount`, `interest_rate`, `monthly_payment`, `due_date`, `status`) VALUES ('23', '12000', 5, 50, '2025-09-03', 'pending')
---
    public function createLoan($data)
    {
        return $this->insert($data);

SELECT *
FROM `loans`
WHERE `user_id` = '23'
---
    public function getLoansByUser($userId)
    {
        return $this->where('user_id', $userId)->findAll();